---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.ShowGraphicalWarningCableTrayConduitDisconnects
source: html/54bf086c-49af-05d2-a95f-e7ecaf6acf9d.htm
---
# Autodesk.Revit.ApplicationServices.Application.ShowGraphicalWarningCableTrayConduitDisconnects Property

Whether or not to show the graphical warnings for CTC disconnects.

## Syntax (C#)
```csharp
public bool ShowGraphicalWarningCableTrayConduitDisconnects { get; set; }
```